In [11]:
import pandas as pd
import numpy as np

### Load the dataset as a dataframe, replace all missing values “?” with NA (in R) or NaN (in Python)

In [12]:
df = pd.read_csv('titanic (4).csv')

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,?,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,?,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,?,S

In [25]:
df = df.replace("?", float("nan"))

In [26]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

### Subset the dataset: keep only columns 2,3,5,6,7,8,10,12

In [27]:

df_data = df.iloc[[2, 3, 5, 6, 7, 8, 10, 12]]

In [28]:
df_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,NaN,S

### For missing values in column “Age”: substitute with the average value of Age

In [29]:
age = df_data["Age"]
age.head()

2     26
3     35
5    NaN
6     54
7      2
Name: Age, dtype: object

In [34]:
age = pd.to_numeric(age)
age_mean = age.mean()
print(age_mean)

24.0

## For missing values in other columns: remove rows with NA

In [20]:
df_data.dropna(axis=1)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,S
5,6,0,3,"Moran, Mr. James",male,0,0,330877,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,3,1,349909,21.0750,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,0,2,347742,11.1333,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,1,1,PP 9549,16.7000,S
12,13,0,3,"Saundercock, Mr. William Henry",male,0,0,A/5. 2151,8.0500,S

In [23]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(train.drop('Survived',axis=1), 
                                                    train['Survived'], test_size=0.30, 
                                                    random_state=101)

In [35]:
X_train

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,"Icard, Miss. Amelie",female,38,0,0,113572,80.0000,B28,NaN
143,144,3,"Burke, Mr. Jeremiah",male,19,0,0,365222,6.7500,NaN,Q
619,620,2,"Gavey, Mr. Lawrence",male,26,0,0,31028,10.5000,NaN,S
69,70,3,"Kink, Mr. Vincenz",male,26,2,0,315151,8.6625,NaN,S
85,86,3,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",female,33,3,0,3101278,15.8500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
88,89,1,"Fortune, Miss. Mabel Helen",female,23,3,2,19950,263.0000,C23 C25 C27,S
737,738,1,"Lesurer, Mr. Gustave J",male,35,0,0,PC 17755,512.3292,B101,C
704,705,3,"Hansen, Mr. Henrik Juul",male,26,1,0,350025,7.8542,NaN,S
417,418,2,"Silven, Miss. Lyyli Karoliina",female,18,0,2,250652,13.0000,NaN,S
642,643,3,"Skoog, Miss. Margit Elizabeth",female,2,3,2,347088,27.9000,NaN,S

## Build a classification model using Training Data

In [24]:
from sklearn.linear_model import LogisticRegression
logmodel = LogisticRegression()
logmodel.fit(X_train,y_train)
predictions = logmodel.predict(X_test)

ValueError: could not convert string to float: 'S'